{"subsection":[{"Name":"ZoneHVAC:AirDistributionUnit","Subsubsections":[{"Name":"Inputs","Paragraph":[{"Name":"Field: Name","Note":["Unique identifying name of the air distribution unit.",""]},{"Name":"Field: Air Distribution Unit Outlet Node Name","Note":["Outlet node name for the air distribution unit to the attached zone.",""]},{"Name":"Field: Air Terminal Object Type","Note":["Single combined component/controller unit for that attached zone. Selection of components as listed above.",""]},{"Name":"Field: Air Terminal Name","Note":["The unique identifying component name.",""]},{"Name":"Field: Nominal Upstream Leakage Fraction","Note":["This is the leakage upstream of the terminal unit as a fraction of the design flow rate through the unit. It is the leakage fraction at the design flow rate. It is used to calculate a leakage flow rate which is then held constant while the system air flow varies. This input is optional; the default is zero.",""]},{"Name":"Field: Constant Downstream Leakage Fraction","Note":["This is the leakage downstream of the terminal unit as a fraction of the current flow rate through the terminal unit. This fraction is held constant, so the leakage flow rate will vary proportinally with the supply air flow rate. This input is optional; the default is zero.",""]},{"Name":"Field: Design Specification Air Terminal Sizing Name","Note":["This optional input field is the name of a DesignSpecification:AirTerminal:Sizing object which specifies sizing adjustments to be made for the air terminal unit referenced by this object. The terminal unit is initially sized according to the inputs in the corresponding Sizing:Zone object. Then the adjustment factors in the DesignSpecification:AirTerminal:Sizing object are applied. See DesignSpecification:AirTerminal:Sizing for more details. If left blank, then no adjustments are made.","","Two example IDF excerpts (one with duct leakage, one without):","","","","ZoneHVAC:AirDistributionUnit,","      SPACE1-1 ATU,            !- Air Distribution Unit Name","      SPACE1-1 In Node,        !- Air Dist Unit Outlet Node Name","      AIRTERMINAL:SINGLEDUCT:VAV:REHEAT,  !- KEY--System Component Type 1","      SPACE1-1 VAV Reheat;     !- Component Name 1","","  ZoneHVAC:AirDistributionUnit,","      SPACE4-1 ATU,            !- Air Distribution Unit Name","      SPACE4-1 In Node,        !- Air Dist Unit Outlet Node Name","      AIRTERMINAL:SINGLEDUCT:VAV:REHEAT,  !- KEY--System Component Type 1","      SPACE4-1 VAV Reheat,     !- Component Name 1","      0.05,                    !- upstream nominal leakage fraction","      0.07;                    !- downstream constant leakage fraction","",""]}]}],"Note":["The ZoneHVAC:AirDistributionUnit object gives further information on what air loop equipment (air terminal units) will be serving a particular zone. The ZoneHVAC:AirDistributionUnit is the part of the system that is supplied from a common main air handler simulated in the Air Loop Simulation and includes the equipment that controls or tempers the air going to each individual zone according to the desired thermostatic control. The current options for ZoneHVAC:AirDistributionUnit terminal unit types are:","","","","  AirTerminal:DualDuct:ConstantVolume","","  AirTerminal:DualDuct:VAV","","  AirTerminal:DualDuct:VAV:OutdoorAir","","  AirTerminal:SingleDuct:ConstantVolume:Reheat","","  AirTerminal:SingleDuct:VAV:Reheat","","  AirTerminal:SingleDuct:VAV:NoReheat","","  AirTerminal:SingleDuct:SeriesPIU:Reheat","","  AirTerminal:SingleDuct:ParallelPIU:Reheat","","  AirTerminal:SingleDuct:ConstantVolume:FourPipeInduction","","  AirTerminal:SingleDuct:VAV:Reheat:VariableSpeedFan","","  AirTerminal:SingleDuct:VAV:HeatAndCool:Reheat","","  AirTerminal:SingleDuct:VAV:HeatAndCool:NoReheat","","  AirTerminal:SingleDuct:ConstantVolume:CooledBeam","","  AirTerminal:SingleDuct:UserDefined","","  AirTerminal:SingleDuct:Mixer"," ","","   ","Connections between the air distribution unit, the supply air duct, and the zone are specified in the input syntax for the air distribution unit and the AirLoopHVAC:ZoneSplitter. The input syntax also explicitly defines an outlet identifier. This implies a connection to a zone through a NodeList for zone inlets (see the ZoneHVAC:EquipmentConnections statement). The air distribution unit is limited to one combined component-controller unit; because controls are normally based on the zone thermostat and can work in parallel or series in complex fashion. Since the control and the flow resolution can be complex, each air distribution unit is unique in addressing these combinations and therefore only one is allowed per zone.","","The Air Distribution unit also allows the user to specify leaks in the supply air duct system. These inputs are used in the EnergyPlus Simplified Duct Leakage Model (SDLM). This model simulates a specific configuration: supply leaks to a return plenum in a commercial VAV or CV system. The system must have a constant static pressure setpoint. Within these limitations SDLM allows the user to easily evaluate the energy penalty due to duct leakage.",""]},{"Name":"ZoneHVAC:EquipmentConnections","Subsubsections":[{"Name":"Inputs","Paragraph":[{"Name":"Field: Zone Name","Note":["Name links this equipment list back to the heat balance for the zone.",""]},{"Name":"Field: Zone Conditioning Equipment List Name","Note":["List of zone equipment for this zone in a ZoneHVAC:EquipmentList object. This list will consist of air distribution units or other direct convection or radiant equipment, i.e.~window air conditioner, baseboard, fan coils, etc.",""]},{"Name":"Field: Zone Air Inlet Node or NodeList Name","Note":["There can be more than one air inlet node depending on how many pieces of equipment are in the ZoneHVAC:EquipmentList. Generally there will be one air inlet node for each piece of zone equipment that delivers conditioned air to the zone. Components such as electric or hot water baseboards and radiant systems do not require zone air inlet nodes. If there is only one node -- its name can be put in this field. If there is more than one node, this must be the name of a node list object (a node list object can also contain only one node name). If this field is not required (as in the baseboard system), it should be blank.",""]},{"Name":"Field: Zone Air Exhaust Node or NodeList Name","Note":["List of exhaust nodes leaving the zone for exhaust fans, zone energy recovery, etc. However these nodes are also used as sources of zone air for zone components such as fan coil units, unit heaters and ventilators, and window air conditioners. For each such component attached to a zone there should be a unique zone exhaust node acting as the inlet node to the component. If there is only one node -- its name can be put in this field. If there is more than one node, this must be the name of a node list object (a node list object can also contain only one node name). If there are no air exhaust nodes, this field should be blank.",""]},{"Name":"Field: Zone Air Node Name","Note":["The conditions at this node represent the average state of the air in the zone. For zones modeled as fully mixed the conditions at this node are assumed to represent the air in the entire zone. This field is required for all ZoneHVAC:EquipmentConnections statements.",""]},{"Name":"Field: Zone Return Air Node or NodeList Name","Note":["The name of one or more return air nodes which attach the zone to an air loop return air path. Even if there is no return air or no return air path, a unique name must be entered in this field. The conditions at each return node represent the state of the air leaving the zone including any heat gain assigned to that return node from Lights, refrigeration equipment or airflow windows.",""]},{"Name":"Field: Zone Return Air Node 1 Flow Rate Fraction Schedule Name","Note":["The name of a schedule to specify the return air flow rate for the first return air node as a fraction of the base return air. If the next field is blank, then the return air flow rate is the total supply inlet flow rate to the zone less the total exhaust node flow rate from the zone multiplied by this schedule name. If this field is left blank, the schedule defaults to 1.0 at all times.",""]},{"Name":"Field: Zone Return Air Node 1 Flow Rate Basis Node or NodeList Name","Note":["The name of a node or list of nodes (NodeList) that is used to calculate the return air flow rate for the first return air node in this zone. The sum of the current flow rates for this node(s) multiplied by the Zone Return Air Node 1 Flow Rate Fraction Schedule determines the return air flow rate. If this field is blank, then the base return air flow rate is the total supply inlet flow rate to the zone less the total exhaust node flow rate from the zone in the case of a single air loop serving this zone. If there are multiple air loops serving this zone, the base return air flow rate is governed by the corresponding supply inlet flow rate and the AirloopHVAC Design Return Air Flow Fraction of Supply Air Flow.","","An example of this statement in an IDF is:","","","","ZoneHVAC:EquipmentConnections,","      SPACE3-1,              !- Zone Name","      SPACE3-1 Eq,           !- List Name: Zone Equipment","      SPACE3-1 In Nodes,     !- List Name: Zone Air Inlet Nodes","      ,                      !- List Name: Zone Air Exhaust Nodes","      SPACE3-1 Node,         !- Zone Air Node Name","      SPACE3-1 Out Node;     !- Zone Return Air Node or NodeList Name","","","The following HVAC equipment types are allowed as zone equipment. The component matrix shows which coils and fans are allowed with which equipment models.","","\\begin{figure}[htbp]","\\centering","\\includegraphics{media/ZoneComponentMatrix.png}","\\caption{}","\\end{figure}",""]}]}],"Note":["Finally, the ZoneHVAC:EquipmentConnections statement defines the remaining details about each thermal zone from an HVAC perspective (besides the controls which were defined above). As with other statements, the first two items in this object are the keyword and an identifying name which links the zone back to its geometrical input, internal gains, etc. and other statements in the HVAC section of the input. The next three items are names of lists (equipment, air inlet nodes, and air exhaust nodes) that are described in more detail below. Note that if there are no air exhaust nodes from the zone that field is left blank. And if there are no air inlet nodes, that field is left blank. Finally, two node names are necessary to complete the zone-HVAC description. The first node is the main air node for the zone upon which the air heat balance is performed. The other node(s) begins the return air path(s) from the zone.","","Note that all nodes mentioned in the ZoneHVAC:EquipmentConnections input must be unique.~ That is, all nodes in all the ZoneHVAC:EquipmentConnections statements referenced by the ``Zone Air Inlet Nodes'', ``Zone Air Exhaust Nodes'', ``Zone Air Node Name'' and ``Zone Return Air Node Name'' cannot have any node name appearing more than once.",""]},{"Name":"ZoneHVAC:EquipmentList","Subsubsections":[{"Name":"Inputs","Paragraph":[{"Name":"Field: Name","Note":["Unique identifying name.",""]},{"Name":"Field: Load Distribution Scheme","Note":["The Load Distribution Scheme selects the algorithm used to allocate the current zone load across the zone equipment. There are four choices: SequentialLoad, UniformLoad, UniformPLR, and SequentialUniformPLR. The default is SequentialLoad. In all cases, the equipment operates in the order specifed by the Zone Equipment Cooling Sequence and Heating or No-Load Sequence fields.","","","","  SequentialLoad loads each piece of available equipment sequentially with the full remaining load. ","","  UniformLoad evenly distributes the total load equally among all available components on the equipment list for the current load type. ","","  UniformPLR evenly distributes the total load among all available components on the equipment list for the current load type at a uniform part load ratio (PLR). ","","  SequentialUniformPLR determines how many of the available components are required to meet the current load, then distributes the load at a uniform part load ratio (PLR).",""]},{"Name":"Field Set (Zone Equipment: Object Type, Name, Cooling Sequence, Heating or No-Load Sequence)","Note":["This set is used together in order to sequence the equipment for heating and cooling. The 1 sequence equipment will try to meet the entire demand with its capacity and then pass the results on to the 2 and so on for both heating and cooling. This field set is extensible by duplicating the last four fields.","","Equipment is simulated in the order specified by Zone Equipment Cooling Sequence and Zone Equipment Heating or No-Load Sequence, depending on the current thermostat request. For equipment of similar type, assign sequence 1 to the first system intended to serve that type of load, assign sequence 2 to the next system, and so on. For situations where one or more equipment types has limited capacity or limited control capability, order the sequence so that the most controllable piece of equipment runs last. For example, with a dedicated outdoor air system (DOAS), the air terminal for the DOAS should be assigned Heating Sequence = 1 and Cooling Sequence = 1. Any other equipment should be assigned sequence 2 or higher so that it will see the net load after the DOAS air is added to the zone.",""]},{"Name":"Field: Zone Equipment <x> Object Type","Note":["Type of zone equipment such as air distribution unit, baseboard, window air conditioner, etc. The current legal types are listed in the following table:","","% table 27","\\begin{longtable}[c]{@{}l@{}}","\\caption{Legal Zone Equipment Types (ZoneHVAC:EquipmentList) \\label{table:legal-zone-equipment-types-zonehvac}} \\tabularnewline","\\toprule ","Legal Zone Equipment Types \\tabularnewline","\\midrule","\\endfirsthead","","\\caption[]{Legal Zone Equipment Types (ZoneHVAC:EquipmentList)} \\tabularnewline","\\toprule ","Legal Zone Equipment Types \\tabularnewline","\\midrule","\\endhead","","AirTerminal:SingleDuct:Uncontrolled \\tabularnewline","Fan:ZoneExhaust \\tabularnewline","WaterHeater:HeatPump:PumpedCondenser \\tabularnewline","WaterHeater:HeatPump:WrappedCondenser \\tabularnewline","ZoneHVAC:AirDistributionUnit \\tabularnewline","ZoneHVAC:Baseboard:Convective:Electric \\tabularnewline","ZoneHVAC:Baseboard:Convective:Water \\tabularnewline","ZoneHVAC:Baseboard:RadiantConvective:Electric \\tabularnewline","ZoneHVAC:Baseboard:RadiantConvective:Water \\tabularnewline","ZoneHVAC:Baseboard:RadiantConvective:Steam \\tabularnewline","ZoneHVAC:Dehumidifier:DX \\tabularnewline","ZoneHVAC:EnergyRecoveryVentilator \\tabularnewline","ZoneHVAC:FourPipeFanCoil \\tabularnewline","ZoneHVAC:HighTemperatureRadiant \\tabularnewline","ZoneHVAC:IdealLoadsAirSystem \\tabularnewline","ZoneHVAC:LowTemperatureRadiant:ConstantFlow \\tabularnewline","ZoneHVAC:LowTemperatureRadiant:Electric \\tabularnewline","ZoneHVAC:LowTemperatureRadiant:VariableFlow \\tabularnewline","ZoneHVAC:OutdoorAirUnit \\tabularnewline","ZoneHVAC:PackagedTerminalAirConditioner \\tabularnewline","ZoneHVAC:PackagedTerminalHeatPump \\tabularnewline","ZoneHVAC:RefrigerationChillerSet \\tabularnewline","ZoneHVAC:UnitHeater \\tabularnewline","ZoneHVAC:UnitVentilator \\tabularnewline","ZoneHVAC:WindowAirConditioner \\tabularnewline","ZoneHVAC:WaterToAirHeatPump \\tabularnewline","ZoneHVAC:VentilatedSlab \\tabularnewline","\\bottomrule","\\end{longtable}",""]},{"Name":"Field: Zone Equipment <x> Name","Note":["Name of the zone equipment used in the object definition of its type.",""]},{"Name":"Field: Zone Equipment <x> Cooling Sequence","Note":["Specifies the zone equipment simulation order when the zone thermostat requests cooling.",""]},{"Name":"Field: Zone Equipment <x> Heating or No-Load Sequence","Note":["Specifies the zone equipment simulation order when the zone thermostat requests heating or no load.","","Examples of this statement in an IDF are:","","","","  ZoneHVAC:EquipmentList,","      Zone1Equipment,          !- Name","      ZoneHVAC:AirDistributionUnit,  !- Zone Equipment 1 Object Type","      Zone1TermReheat,         !- Zone Equipment 1 Name","      1,                       !- Zone Equipment 1 Cooling Sequence","      1;                       !- Zone Equipment 1 Heating or No-Load Sequence","","","    ZoneHVAC:EquipmentList,","      Zone1Equipment,          !- Name","      AirTerminal:SingleDuct:Uncontrolled,  !- Zone Equipment 1 Object Type","      Zone1DirectAir,          !- Zone Equipment 1 Name","      1,                       !- Zone Equipment 1 Cooling Sequence","      1,                       !- Zone Equipment 1 Heating or No-Load Sequence","      ZoneHVAC:WaterToAirHeatPump,  !- Zone Equipment 2 Object Type","      Zone1WTAHP,              !- Zone Equipment 2 Name","      2,                       !- Zone Equipment 2 Cooling Sequence","      2;                       !- Zone Equipment 2 Heating or No-Load Sequence",""]}]}],"Note":["The first list encountered in the ZoneHVAC:EquipmentConnections statement is the ZoneHVAC:EquipmentList. This object lists all HVAC equipment serving the zone. Each item in the list has four fields associated with it: Object Type, Name, Cooling Sequence and Heating or No-Load Sequence The Object Type and Name identify the specific equipment object. Cooling Sequence and Heating or No-Load Sequence specify the order of simulation for zones with more than one type of HVAC equipment.","","Note that a ZoneHVAC:AirDistributionUnit or AirTerminal:SingleDuct:Uncontrolled must be listed in this statement if there is a forced air system serving the zone from an air loop.",""]}]}