{"subsection":[{"Name":"Pump:VariableSpeed","Subsubsections":[{"Name":"Inputs","Paragraph":[{"Name":"Field: Name","Note":["This alpha field contains the identifying a unique name for the pump.",""]},{"Name":"Field: Inlet Node Name","Note":["This alpha field contains the identifying name for the pump inlet node.",""]},{"Name":"Field: Outlet Node Name","Note":["This alpha field contains the identifying name for the pump outlet node.",""]},{"Name":"Field: Design Maximum Flow Rate","Note":["This numeric field contains the pump's design maximum volume flow rate in cubic meters per second. This field can be autosized.",""]},{"Name":"Field: Design Pump Head","Note":["This numeric field contains the pump's design head pressure in Pascals. The default is 179352 Pa, or 60 ftH20, and is for a fairly large building.",""]},{"Name":"Field: Design Power Consumption","Note":["This numeric field contains the pump's design power consumption in Watts. If the user is performing a pressure simulation on the loop in which this pump is found, this value would only be used to estimate pump efficiency. During reported calculations, the pump would use the loop pressure drop and current flow conditions along with efficiency to calculate pump power dynamically. This field can be autosized. When set to autosize the type of scaling factor is chosen in the input field Design Power Sizing Method.",""]},{"Name":"Field: Motor Efficiency","Note":["This numeric field contains the pump motor's efficiency in decimal form (0 = 0%, 1 = 100%).",""]},{"Name":"Field: Fraction of Motor Inefficiencies to Fluid Stream","Note":["This numeric field contains the pump motor's fraction of power loss to the fluid.",""]},{"Name":"Field: Coefficient 1 of the Part Load Performance Curve","Note":["This numeric field contains the first coefficient in the part load ratio curve. The fraction of full load power is determined by the cubic equation:","","","FractionFullLoadPower = {C_1} + {C_2}PLR + {C_3}PL{R^2} + {C_4}PL{R^3}","","","where C_{1},C_{2},C_{3},and C_{4} are Coefficients 1 4 (below) and PLR is the Part Load Ratio.",""]},{"Name":"Field: Coefficient 2 of the Part Load Performance Curve","Note":["This numeric field contains the second coefficient in the part load ratio curve.",""]},{"Name":"Field: Coefficient 3 of the Part Load Performance Curve","Note":["This numeric field contains the third coefficient in the part load ratio curve.",""]},{"Name":"Field: Coefficient 4 of the Part Load Performance Curve","Note":["This numeric field contains the fourth coefficient in the part load ratio curve.",""]},{"Name":"Field: Design Minimum Flow Rate","Note":["This field contains the minimum volume flow rate while operating in variable flow capacity rate in cubic meters per second. This field is autosizable. When set to autosize the value in the input field Design Minimum Flow Rate Sizing Factor is used to scale the minimum flow rate as a fraction of the Design Maximum Flow Rate.",""]},{"Name":"Field: Pump Control Type","Note":["This is a choice field of Continuous or Intermittent. A variable speed pump is defined with maximum and minimum flow rates that are the physical limits of the device. If there is no load on the loop and the pump is operating intermittently, then the pump can shutdown. For any other condition such as the loop having a load and the pump is operating intermittently or the pump is continuously operating (regardless of the loading condition), the pump will operate and select a flow somewhere between the minimum and maximum limits. In these cases where the pump is running, it will try to meet the flow request made by demand side components. Applicable availability managers (ref. AvailabilityManagerAssignmentList) may override this control by forcing the pump to be on or off.",""]},{"Name":"Field: Pump Flow Rate Schedule Name","Note":["The schedule values modify the value for Rated Flow Rate of the pump on a time basis. This essentially sets the maximum value available for the pump at a given time, {not the actual flow rate at that time}. The default is that the pump is ON and runs according to its other operational requirements specified above. This schedule is for special, not typical pump operations. For additional control over pump flow, EMS actuators can be employed.",""]},{"Name":"Field: Pump Curve Name","Note":["This references a pump curve to be used during pump flow-loop head resolution. This is only applicable for loop simulations which include pressure components on at least a single branch. More information regarding pressure system simulation is available in the engineering reference.",""]},{"Name":"Field: Impeller Diameter","Note":["For pressure simulation cases, this is the impeller diameter used during calculations which is used in non-dimensionalizing the pump curve described in the previous field. The units of this value are meters.",""]},{"Name":"Field: VFD Control Type","Note":["This string defines which type of VFD control type to perform. PressureSetPointControl is a realistic approach which requires inputs of pressure range schedules to control the pump rpm to maintain a certain pressure drop (head). ManualControl is an idealized control strategy in which the pump RPM is maintained at a scheduled value throughout the simulation, abiding by other flow restrictions in the loop.",""]},{"Name":"Field: Pump RPM Schedule Name","Note":["For VFD Control Type = ManualControl, this defines the pump RPM schedule to use during the simulation. For VFD Control Type = PressureSetPointControl, this field is not interpreted. The value of the schedule is RPM.",""]},{"Name":"Field: Minimum Pressure Schedule","Note":["For VFD Control Type = PressureSetPointControl, this field defines the minimum pressure range setpoint value, or the lower bound of pressure drop (head) to use when determining the required pump speed. For VFD Control Type = ManualControl, this field is not interpreted. The value of the schedule is Pascals.",""]},{"Name":"Field: Maximum Pressure Schedule","Note":["For VFD Control Type = PressureSetPointControl, this field defines the maximum pressure range setpoint value, or the upper bound of pressure drop (head) to use when determining the required pump speed. For VFD Control Type = ManualControl, this field is not interpreted. The value of the schedule is Pascals.",""]},{"Name":"Field: Minimum RPM Schedule","Note":["For VFD Control Type = PressureSetPointControl, this field defines the minimum allowable RPM, or the lower bound of pump speed to use when determining the required pump speed. For VFD Control Type = ManualControl, this field is not interpreted. The value of the schedule is RPM.",""]},{"Name":"Field: Maximum RPM Schedule","Note":["For VFD Control Type = PressureSetPointControl, this field defines the maximum allowable RPM, or the upper bound of pump speed to use when determining the required pump speed. For VFD Control Type = ManualControl, this field is not interpreted. The value of the schedule is RPM.",""]},{"Name":"Field: Zone Name","Note":["This field is optional. It can be used to input the name of the Zone in which the pump is located in the model. If the pump is outdoors, or skin losses are not to be modeled, then leave this field blank. If a valid Zone name is entered, then the portion of electrical power consumed by the pump that is not added to the working fluid is added to the surrounding Zone.",""]},{"Name":"Field: Skin Loss Radiative Fraction","Note":["This field is optional. If a Zone is named in the previous field and pump losses are to be added to a surrounding thermal zone, then this input determines the split between thermal radiation and thermal convection for the heat losses from the pump. If it is left blank then all the losses will be convective.",""]},{"Name":"Field: Design Power Sizing Method","Note":["This field is optional. There are two choices PowerPerFlow and PowerPerFlowPerPressure. If PowerPerFlow is used the pump's Design Power Consumption will be calculated using the sizing factor from the input field Design Electric Power per Unit Flow Rate -- with Design Power Consumption = Design Maximum Flow Rate * scaling factor. If PowerPerFlowPerPressure is used the pump's Design Power Consumption will use the sizing factor from the input field Design Shaft Power per Unit Flow Rate Per Unit Head -- with Design Power Consumption = Design Maximum Flow Rate * Design Pump Head * scaling factor / Motor Efficiency. If omitted the default method of PowerPerFlowPerPressure will be used.",""]},{"Name":"Field: Design Electric Power per Unit Flow Rate","Note":["This field is optional. This input is used when the input field Design Power Consumption is set to autosize and the Design Power Sizing Method is set to PowerPerFlow. It allows setting the efficiency the pumping system's power consumption using only the design flow rate. If omitted the default value of 348701.1 W/(m^{3}/s) ( 22 W/gpm) will be used.",""]},{"Name":"Field: Design Shaft Power per Unit Flow Rate Per Unit Head","Note":["This field is optional. This input is used when the input field Design Power Consumption is set to autosize and the Design Power Sizing Method is set to PowerPerFlowPerPressure. It allows setting the efficiency of the impeller and drive assembly when calculating the pump power consumption for the design flow rate, motor efficiency, and pump head. If omitted the default value of 1.282051 W/((m^{3}/s)-Pa) will be used.",""]},{"Name":"Field: Design Minimum Flow Rate Sizing Factor","Note":["This field is optional. If omitted the default value of 0.0 will be used. This input is used when the input field Design Minimum Flow Rate is set to autosize. The minimum flow rate will be set to the product of this sizing factor and the Design Maximum Flow Rate.",""]},{"Name":"Field: End-Use Subcategory","Note":["Allows you to specify a user-defined end-use subcategory, e.g., ``Main Pumps'', etc. A new meter for reporting is created for each unique subcategory (ref: Output:Meter objects). Subcategories are also reported in the ABUPS table. If this field is omitted or blank, the pump will be assigned to the ``General'' end-use subcategory.","","Examples of this object in the IDF follow.","","","","Pump:VariableSpeed,","  HW Circ Pump,                          !- Name","  HW Supply Inlet Node,                  !- Inlet Node Name","  HW Pump Outlet Node,                   !- Outlet Node Name","  autosize,                              !- Design Maximum Flow Rate {m3/s}","  179352,                                !- Design Pump Head {Pa}","  autosize,                              !- Design Power Consumption {W}","  0.9,                                   !- Motor Efficiency","  0.0,                                   !- Fraction of Motor Inefficiencies to Fluid Stream","  0,                                     !- Coefficient 1 of the Part Load Performance Curve","  1,                                     !- Coefficient 2 of the Part Load Performance Curve","  0,                                     !- Coefficient 3 of the Part Load Performance Curve","  0,                                     !- Coefficient 4 of the Part Load Performance Curve","  0,                                     !- Minimum Flow Rate {m3/s}","  Intermittent;                          !- Pump Control Type","","","  Pump:VariableSpeed,","  Circ Pump,                             !- Name","  CW Supply Inlet Node,                  !- Inlet Node Name","  CW Pump Outlet Node,                   !- Outlet Node Name","  .0011,                                 !- Design Maximum Flow Rate {m3/s}","  300000,                                !- Design Pump Head {Pa}","  500,                                   !- Design Power Consumption {W}","  .87,                                   !- Motor Efficiency","  0.0,                                   !- Fraction of Motor Inefficiencies to Fluid Stream","  0,                                     !- Coefficient 1 of the Part Load Performance Curve","  1,                                     !- Coefficient 2 of the Part Load Performance Curve","  0,                                     !- Coefficient 3 of the Part Load Performance Curve","  0,                                     !- Coefficient 4 of the Part Load Performance Curve","  0,                                     !- Minimum Flow Rate {m3/s}","  Intermittent;                          !- Pump Control Type","",""]}]},{"Name":"Outputs","Paragraph":[{"Name":"Pump Electric Power [W]"},{"Name":"Pump Electric Energy [J]","Note":["These outputs are the electric power input to the pump motor. Consumption is metered on Pumps:Electricity, Electricity:Plant, and Electricity:Facility.",""]},{"Name":"Pump Shaft Power [W]","Note":["This is the shaft power delivered from the motor to the pump.",""]},{"Name":"Pump Fluid Heat Gain Rate [W]"},{"Name":"Pump Fluid Heat Gain Energy [J]","Note":["These outputs are the energy added to the fluid as heat. For the current algorithm, this is equal to Pump Shaft Power, because the loops are closed and all energy added to the fluid will ultimately become heat due to friction.",""]},{"Name":"Pump Outlet Temperature [C]"},{"Name":"Pump Mass Flow Rate [kg/s]","Note":["These outputs are the water outlet temperature and mass flow rate.",""]},{"Name":"Pump Zone Total Heating Rate [W]"},{"Name":"Pump Zone Total Heating Energy [J]","Note":["These outputs are the thermal losses from the pump to the surrounding Zone. They are only available if a Zone was named in the pump s input. These indicate the amount of heat added to the zone from the pump s inefficiencies. They are the total heat loss including both convection and radiation.",""]},{"Name":"Pump Zone Convective Heating Rate [W]","Note":["This output is the thermal loss from the pump to the surrounding Zone in the form of convective gains directly to the zone air. It is only available if a Zone was named in the pump input.",""]},{"Name":"Pump Zone Radiative Heating Rate [W]","Note":["This output is the thermal loss from the pump to the surrounding Zone in the form of thermal radiation gains directly to the inside face of the zone s surfaces. It is only available if a Zone was named in the pump input.",""]}],"Note":["  HVAC,Average,Pump Electric Power [W]","","  HVAC,Sum,Pump Electric Energy [J]","","  HVAC,Average,Pump Shaft Power [W]","","  HVAC,Average,Pump Fluid Heat Gain Rate [W]","","  HVAC,Sum,Pump Fluid Heat Gain Energy [J]","","  HVAC,Average,Pump Outlet Temperature [C]","","  HVAC,Average,Pump Mass Flow Rate [kg/s]","","  HVAC,Average,Pump Zone Total Heating Rate [W]","","  HVAC,Sum,Pump Zone Total Heating Energy [J]","","  HVAC,Average,Pump Zone Convective Heating Rate [W]","","  HVAC,Average,Pump Zone Radiative Heating Rate [W]","",""]}],"Note":["Pumps are needed in both plant and condenser loops. The syntax for a variable speed pump is given below.",""]},{"Name":"Pump:ConstantSpeed","Subsubsections":[{"Name":"Inputs","Paragraph":[{"Name":"Field: Name","Note":["This alpha field contains the identifying name for the pump.",""]},{"Name":"Field: Inlet Node Name","Note":["This alpha field contains the identifying name for the pump inlet node.",""]},{"Name":"Field: Outlet Node Name","Note":["This alpha field contains the identifying name for the pump outlet node.",""]},{"Name":"Field: Design Flow Rate","Note":["This numeric field contains the pump's design volume flow rate in cubic meters per second. This field is autosizable.",""]},{"Name":"Field: Design Pump Head","Note":["This numeric field contains the pump's design head pressure in Pascals. The default is 179352 Pa, or 60 ftH20, and is for a fairly large building.",""]},{"Name":"Field: Design Power Consumption","Note":["This numeric field contains the pump's design power consumption in Watts. If the user is performing a pressure simulation on the loop in which this pump is found, this value would only be used to estimate pump efficiency. During reported calculations, the pump would use the loop pressure drop and current flow conditions along with efficiency to calculate pump power dynamically. This field can be autosized. When set to autosize the type of scaling factor is chosen in the input field Design Power Sizing Method.",""]},{"Name":"Field: Motor Efficiency","Note":["This numeric field contains the pump motor's efficiency in decimal form (0 = 0%, 1 = 100%).",""]},{"Name":"Field: Fraction of Motor Inefficiencies to Fluid Stream","Note":["This numeric field contains the pump motor's fraction of power loss to the fluid.",""]},{"Name":"Field: Pump Control Type","Note":["This is a choice field of Continuous or Intermittent. The operation of a constant speed pump is fairly straightforward. If the user designates a constant speed pump that is operating continuously, the pump will run regardless of whether or not there is a load. This may have the net effect of adding heat to the loop if no equipment is turned on. If the pump is constant speed and operates intermittently, the pump will run at its capacity if a load is sensed and will shut off if there is no load on the loop. Applicable availability managers (ref. AvailabilityManagerAssignmentList) may override this control by forcing the pump to be on or off.",""]},{"Name":"Field: Pump Flow Rate Schedule Name","Note":["The schedule values modify the value for Rated Flow Rate of the pump on a time basis. This essentially sets the maximum value available for the pump at a given time, {not the actual flow rate at that time}. The default is that the pump is ON and runs according to its other operational requirements specified above. This schedule is for special, not typical pump operations. For additional control over pump flow, EMS actuators can be employed.",""]},{"Name":"Field:Pump Curve Name","Note":["This field is only used if the user is performing a pressure-based simulation in the plant loop of the LoopFlowCorrection type (see PlantLoop section for how to enable this).","","This field references a separate pressure head curve that the user has input separately in the input file. The pressure curve represents a non-dimensional regression of pressure-flow rate data. The equation should be of the following form:","","","\\psi  = {C_4} \\times {\\varphi ^4} + {C_3} \\times {\\varphi ^3} + {C_2} \\times {\\varphi ^2} + {C_1} \\times \\varphi  + {C_0}.","","","In this equation, the two dimensionless parameters, X and X are defined in terms of physical pump and flow parameters as:","","","\\psi  = \\frac{{\\Delta P}}{{\\rho {N^2}{D^2}}}","","","","\\varphi  = \\frac{{\\dot m}}{{\\rho N{D^3}}}","","","Where Delta P is the pressure drop, mdot is the fluid mass flow rate, rho is a representative fluid density, N is the rotational speed of the pump, and D is the pump impeller diameter.","","Since the user may not need a full fourth order expansion of this, the user may use linear (first order), quadratic (second order), cubic (third order), or full quartic (fourth order). These are available in the objects Curve:Linear, Curve:Quadratic, Curve:Cubic, Curve:Quartic.","","Once this curve is input properly (along with the following two fields), the pump will respond to the plant loop pressure drop when resolving the flow rate. Note that this simulation method will likely result in a plant loop that does not exactly hit the setpoint as the current simulation method does. This is due to the loop flow rate now being pressure-based and not decision-based .",""]},{"Name":"Field:Impeller Diameter","Note":["This field is only used if the user is performing a pressure-based simulation in the plant loop of the LoopFlowCorrection type (see PlantLoop section for how to enable this).","","To re-dimensionalize the dimensionless pump curve, the impeller diameter must be known. This value is entered in meters.",""]},{"Name":"Field:Rotational Speed","Note":["This field is only used if the user is performing a pressure-based simulation in the plant loop of the LoopFlowCorrection type (see PlantLoop section for how to enable this).","","To re-dimensionalize the dimensionless pump curve, the rotational speed must be known. This value is entered in RPM (revolutions per minute).",""]},{"Name":"Field: Zone Name","Note":["This field is optional. It can be used to input the name of the Zone in which the pump is located in the model. If the pump is outdoors, or skin losses are not to be modeled, then leave this field blank. If a valid Zone name is entered, then the portion of electrical power consumed by the pump that is not added to the working fluid is added to the surrounding Zone.",""]},{"Name":"Field: Skin Loss Radiative Fraction","Note":["This field is optional. If a Zone is named in the previous field and pump losses are to be added to a surrounding thermal zone, then this input determines the split between thermal radiation and thermal convection for the heat losses from the pump. If it is left blank then all the losses will be convective.",""]},{"Name":"Field: Design Power Sizing Method","Note":["This field is optional. There are two choices PowerPerFlow and PowerPerFlowPerPressure. If omitted the default method of PowerPerFlowPerPressure will be used.","","If PowerPerFlow is used the pump's Design Power Consumption will be calculated using the sizing factor from the input field Design Electrical Power per Unit Flow Rate -- with Design Power Consumption = Design Maximum Flow Rate * scaling factor.","","If PowerPerFlowPerPressure is used the pump's Design Power Consumption will use the sizing factor from the input field Design Shaft Power per Unit Flow Rate Per Unit Head -- with Design Power Consumption = Design Maximum Flow Rate * Design Pump Head * scaling factor / Motor Efficiency.",""]},{"Name":"Field: Design Electrical Power per Unit Flow Rate","Note":["This field is optional. This input is used when the input field Design Power Consumption is set to autosize and the Design Power Sizing Method is set to PowerPerFlow. It allows setting the efficiency the pumping system's power consumption using only the design flow rate. If omitted the default value of 348701.1 W/(m^{3}/s) (22 W/gpm) will be used.",""]},{"Name":"Field: Design Shaft Power per Unit Flow Rate Per Unit Head","Note":["This field is optional. This input is used when the input field Design Power Consumption is set to autosize and the Design Power Sizing Method is set to PowerPerFlowPerPressure. It allows controlling the efficiency of the impeller and drive assembly when calculating the pump power consumption for the design flow rate, motor efficiency, and pump head. If omitted the default value of 1.282051 W/((m^{3}/s)-Pa) will be used.",""]},{"Name":"Field: End-Use Subcategory","Note":["Allows you to specify a user-defined end-use subcategory, e.g., ``Main Pumps'', etc. A new meter for reporting is created for each unique subcategory (ref: Output:Meter objects). Subcategories are also reported in the ABUPS table. If this field is omitted or blank, the pump will be assigned to the ``General'' end-use subcategory.","","An example of this object follows.","","","","Pump:ConstantSpeed,","  Circ Pump,                         !- Name","  CW Supply Inlet Node,              !- Inlet Node Name","  PumpChiller Node,                  !- Outlet Node Name","  0.0011,                            !- Design Flow Rate","  300000,                            !- Design Pump Head","  700,                               !- Design Power Consumption","  0.87,                              !- Motor Efficiency","  0.0,                               !- Fraction of Motor Inefficiencies to Fluid Stream","  Intermittent;                      !- Pump Control Type","",""]}]},{"Name":"Outputs","Paragraph":[{"Name":"Pump Electric Power [W]"},{"Name":"Pump Electric Energy [J]","Note":["These outputs are the electric power input to the pump motor. Consumption is metered on Pumps:Electricity, Electricity:Plant, and Electricity:Facility.",""]},{"Name":"Pump Shaft Power [W]","Note":["This is the shaft power delivered from the motor to the pump.",""]},{"Name":"Pump Fluid Heat Gain Rate [W]"},{"Name":"Pump Fluid Heat Gain Energy [J]","Note":["These outputs are the energy added to the fluid as heat. For the current algorithm, this is equal to Pump Shaft Power, because the loops are closed and all energy added to the fluid will ultimately become heat due to friction.",""]},{"Name":"Pump Outlet Temperature [C]"},{"Name":"Pump Mass Flow Rate [kg/s]","Note":["These outputs are the water outlet temperature and mass flow rate.",""]},{"Name":"Pump Zone Convective Heating Rate [W]","Note":["This output is the thermal loss from the pump to the surrounding Zone in the form of convective gains directly to the zone air. It is only available if a Zone was named in the pump input.",""]},{"Name":"Pump Zone Radiative Heating Rate [W]","Note":["This output is the thermal loss from the pump to the surrounding Zone in the form of thermal radiation gains directly to the inside face of the zone s surfaces. It is only available if a Zone was named in the pump input.",""]},{"Name":"Pump Zone Total Heating Energy [J]"},{"Name":"Pump Zone Total Heating Rate [W]","Note":["These outputs are the thermal losses from the pump to the surrounding Zone. They are only available if a Zone was named in the pump s input. These indicate the amount of heat added to the zone from the pump s inefficiencies. They are the total heat loss including both convection and radiation.",""]}],"Note":["  HVAC,Average,Pump Electric Power [W]","","  HVAC,Sum,Pump Electric Energy [J]","","  HVAC,Average,Pump Shaft Power [W]","","  HVAC,Average,Pump Fluid Heat Gain Rate [W]","","  HVAC,Sum,Pump Fluid Heat Gain Energy [J]","","  HVAC,Average,Pump Outlet Temperature [C]","","  HVAC,Average,Pump Mass Flow Rate [kg/s]","","  HVAC,Average,Pump Zone Total Heating Rate [W]","","  HVAC,Sum,Pump Zone Total Heating Energy [J]","","  HVAC,Average,Pump Zone Convective Heating Rate [W]","","  HVAC,Average,Pump Zone Radiative Heating Rate [W]","",""]}],"Note":["Pumps may be found in both plant and condenser loops. The syntax for a constant speed pump is given below.",""]},{"Name":"Pump:VariableSpeed:Condensate","Subsubsections":[{"Name":"Inputs","Paragraph":[{"Name":"Field: Name","Note":["This alpha field contains the identifying unique name for the pump.",""]},{"Name":"Field: Inlet Node Name","Note":["This alpha field contains the identifying name for the pump inlet node.",""]},{"Name":"Field: Outlet Node Name","Note":["This alpha field contains the identifying name for the pump outlet node.",""]},{"Name":"Field: Design Steam Volume Flow Rate","Note":["This numeric field contains the pump's design volume flow rate in cubic meters per second. This field is autosizable. This is the volume flow rate of steam in expanded stated. The volume of condensate is calculated by the software from the steam density and is much lower.",""]},{"Name":"Field: Design Pump Head","Note":["This numeric field contains the pump's design head in Pascals. The default is 179352 Pa, or 60 ftH20, and is for a fairly large building.",""]},{"Name":"Field: Design Power Consumption","Note":["This numeric field contains the pump's rated power consumption in Watts. If the user is performing a pressure simulation on the loop in which this pump is found, this value would only be used to estimate pump efficiency. During reported calculations, the pump would use the loop pressure drop and current flow conditions along with efficiency to calculate pump power dynamically. This field can be autosized. When set to autosize the type of scaling factor is chosen in the input field Design Power Sizing Method.",""]},{"Name":"Field: Motor Efficiency","Note":["This numeric field contains the pump motor's efficiency in decimal form (0 = 0%, 1 = 100%).",""]},{"Name":"Field: Fraction of Motor Inefficiencies to Fluid Stream","Note":["This numeric field contains the pump motor's fraction of power loss to the fluid.",""]},{"Name":"Field: Coefficient 1 of the Part Load Performance Curve","Note":["This numeric field contains the first coefficient in the part load ratio curve. The fraction of full load power is determined by the cubic equation:","","","FractionFullLoadPower = {C_1} + {C_2}PLR + {C_3}PL{R^2} + {C_4}PL{R^3}","","","where C_{1},C_{2},C_{3},and C_{4} are Coefficients 1 4 (below) and PLR is the Part Load Ratio.",""]},{"Name":"Field: Coefficient 2 of the Part Load Performance Curve","Note":["This numeric field contains the second coefficient in the part load ratio curve.",""]},{"Name":"Field: Coefficient 3 of the Part Load Performance Curve","Note":["This numeric field contains the third coefficient in the part load ratio curve.",""]},{"Name":"Field: Coefficient 4 of the Part Load Performance Curve","Note":["This numeric field contains the fourth coefficient in the part load ratio curve.",""]},{"Name":"Field: Pump Flow Rate Schedule Name","Note":["The schedule values modify the value for Rated Flow Rate of the pump on a time basis. This essentially sets the maximum value available for the pump at a given time, {not the actual flow rate at that time}. The default is that the pump is ON and runs according to its other operational requirements specified above. This schedule is for special, not typical pump operations. For additional control over pump flow, EMS actuators can be employed.",""]},{"Name":"Field: Zone Name","Note":["This field is optional. It can be used to input the name of the Zone in which the pump is located in the model. If the pump is outdoors, or skin losses are not to be modeled, then leave this field blank. If a valid Zone name is entered, then the portion of electrical power consumed by the pump that is not added to the working fluid is added to the surrounding Zone.",""]},{"Name":"Field: Skin Loss Radiative Fraction","Note":["This field is optional. If a Zone is named in the previous field and pump losses are to be added to a surrounding thermal zone, then this input determines the split between thermal radiation and thermal convection for the heat losses from the pump. If it is left blank then all the losses will be convective.",""]},{"Name":"Field: Design Power Sizing Method","Note":["This field is optional. There are two choices PowerPerFlow and PowerPerFlowPerPressure. If PowerPerFlow is used the pump's Design Power Consumption will be calculated using the sizing factor from the input field Design Electric Power per Unit Flow Rate -- with Design Power Consumption = Design Maximum Flow Rate * scaling factor. If PowerPerFlowPerPressure is used the pump's Design Power Consumption will use the sizing factor from the input field Design Shaft Power per Unit Flow Rate Per Unit Head -- with Design Power Consumption = Design Maximum Flow Rate * Design Pump Head * scaling factor / Motor Efficiency. If omitted the default method of PowerPerFlowPerPressure will be used.",""]},{"Name":"Field: Design Electric Power per Unit Flow Rate","Note":["This field is optional. This input is used when the input field Design Power Consumption is set to autosize and the Design Power Sizing Method is set to PowerPerFlow. It allows setting the efficiency the pumping system's power consumption using only the design flow rate. If omitted the default value of 348701.1 W/(m^{3}/s) ( 22 W/gpm) will be used.",""]},{"Name":"Field: Design Shaft Power per Unit Flow Rate Per Unit Head","Note":["This field is optional. This input is used when the input field Design Power Consumption is set to autosize and the Design Power Sizing Method is set to PowerPerFlowPerPressure. It allows setting the efficiency of the impeller and drive assembly when calculating the pump power consumption for the design flow rate, motor efficiency, and pump head. If omitted the default value of 1.282051 W/((m^{3}/s)-Pa) will be used.",""]},{"Name":"Field: End-Use Subcategory","Note":["Allows you to specify a user-defined end-use subcategory, e.g., ``Main Pumps'', etc. A new meter for reporting is created for each unique subcategory (ref: Output:Meter objects). Subcategories are also reported in the ABUPS table. If this field is omitted or blank, the pump will be assigned to the ``General'' end-use subcategory.","","Examples of this object in the IDF follow.","","","","Pump:VariableSpeed:Condensate,","  Steam Boiler Plant Steam Circ Pump,         !- Name","  Steam Boiler Plant Steam Supply Inlet Node, !- Inlet Node Name","  Steam Boiler Plant Steam Pump Outlet Node,  !- Outlet Node Name","  0.36,                                  !- Design Steam Volume Flow Rate {m3/s}","  179352,                                !- Design Pump Head {Pa}","  400,                                   !- Design Power Consumption {W}","  0.9,                                   !- Motor Efficiency","  0.0,                                   !- Fraction of Motor Inefficiencies to Fluid Stream","  0,                                     !- Coefficient 1 of the Part Load Performance Curve","  1,                                     !- Coefficient 2 of the Part Load Performance Curve","  0,                                     !- Coefficient 3 of the Part Load Performance Curve","  0;                                     !- Coefficient 4 of the Part Load Performance Curve","","","  Pump:VariableSpeed:Condensate,","  Steam Boiler Plant Steam Circ Pump,         !- Name","  Steam Boiler Plant Steam Supply Inlet Node, !- Inlet Node Name","  Steam Boiler Plant Steam Pump Outlet Node,  !- Outlet Node Name","  0.36,                                  !- Design Steam Volume Flow Rate {m3/s}","  179352,                                !- Design Pump Head {Pa}","  autosize,                              !- Design Power Consumption {W}","  0.9,                                   !- Motor Efficiency","  0.0,                                   !- Fraction of Motor Inefficiencies to Fluid Stream","  0,                                     !- Coefficient 1 of the Part Load Performance Curve","  1,                                     !- Coefficient 2 of the Part Load Performance Curve","  0,                                     !- Coefficient 3 of the Part Load Performance Curve","  0;                                     !- Coefficient 4 of the Part Load Performance Curve","",""]}]},{"Name":"Outputs","Paragraph":[{"Name":"Pump Electric Power [W]"},{"Name":"Pump Electric Energy [J]","Note":["These outputs are the electric power input to the pump motor. Consumption is metered on Pumps:Electricity, Electricity:Plant, and Electricity:Facility.",""]},{"Name":"Pump Shaft Power [W]","Note":["This is the shaft power delivered from the motor to the pump.",""]},{"Name":"Pump Fluid Heat Gain Rate [W]"},{"Name":"Pump Fluid Heat Gain Energy [J]","Note":["These outputs are the energy added to the fluid as heat. For the current algorithm, this is equal to Pump Shaft Power, because the loops are closed and all energy added to the fluid will ultimately become heat due to friction.",""]},{"Name":"Pump Outlet Temperature [C]"},{"Name":"Pump Mass Flow Rate [kg/s]","Note":["These outputs are the water outlet temperature and mass flow rate.",""]},{"Name":"Pump Zone Total Heating Rate [W]"},{"Name":"Pump Zone Total Heating Energy [J]","Note":["These outputs are the thermal losses from the pump to the surrounding Zone. They are only available if a Zone was named in the pump s input. These indicate the amount of heat added to the zone from the pump s inefficiencies. They are the total heat loss including both convection and radiation.",""]},{"Name":"Pump Zone Convective Heating Rate [W]","Note":["This output is the thermal loss from the pump to the surrounding Zone in the form of convective gains directly to the zone air. It is only available if a Zone was named in the pump input.",""]},{"Name":"Pump Zone Radiative Heating Rate [W]","Note":["This output is the thermal loss from the pump to the surrounding Zone in the form of thermal radiation gains directly to the inside face of the zone s surfaces. It is only available if a Zone was named in the pump input.",""]}],"Note":["  HVAC,Average,Pump Electric Power [W]","","  HVAC,Sum,Pump Electric Energy [J]","","  HVAC,Average,Pump Shaft Power [W]","","  HVAC,Average,Pump Fluid Heat Gain Rate [W]","","  HVAC,Sum,Pump Fluid Heat Gain Energy [J]","","  HVAC,Average,Pump Outlet Temperature [C]","","  HVAC,Average,Pump Mass Flow Rate [kg/s]","","  HVAC,Average, Pump Zone Total Heating Rate [W]","","  HVAC, Sum, Pump Zone Total Heating Energy [J]","","  HVAC, Average, Pump Zone Convective Heating Rate [W]","","  HVAC, Average, Pump Zone Radiative Heating Rate [W]","",""]}],"Note":["The Pump:VariableSpeed:Condensate object can only be used in steam system simulation for the condensate side of the loop. This is a variable speed pump, which pumps the condensate back to the steam boiler. The syntax for condensate pump is given below.",""]},{"Name":"HeaderedPumps:ConstantSpeed","Subsubsections":[{"Name":"Inputs","Paragraph":[{"Name":"Field: Name","Note":["This alpha field contains the identifying name for the pump bank.",""]},{"Name":"Field: Inlet Node Name","Note":["This alpha field contains the identifying name for the pump bank inlet node.",""]},{"Name":"Field: Outlet Node Name","Note":["This alpha field contains the identifying name for the pump bank outlet node.",""]},{"Name":"Field: Total Design Flow Rate","Note":["This numeric field contains the pump bank s rated volumetric flow rate in cubic meters per second. This is equal to the product of number of pumps and the flow rate of each individual pump. The field can be autosized.",""]},{"Name":"Field: Number of Pumps in Bank","Note":["The numeric field specifies the number of pumps present in the pump bank. All these pumps are connected in parallel internally.",""]},{"Name":"Field: Flow Sequencing Control Scheme","Note":["The alpha field specifies the scheme for sequencing flow. Currently the only choice is Sequential, where a pump in the pump bank will be turned ON only after fully loading the previous pump.",""]},{"Name":"Field: Design Pump Head","Note":["This numeric field contains the pump's design head pressure in Pascals.",""]},{"Name":"Field: Design Power Consumption","Note":["This numeric field contains the pump bank's total power consumption in Watts. This field is equal to the product of number of pumps and the rated power consumption of each individual pump. If the user is performing a pressure simulation on the loop in which this pump bank is found, this value would only be used to estimate pump efficiency. During reported calculations, the pump would use the loop pressure drop and current flow conditions along with efficiency to calculate pump power dynamically. This field can be autosized. When set to autosize the type of scaling factor is chosen in the input field Design Power Sizing Method.",""]},{"Name":"Field: Motor Efficiency","Note":["This numeric field contains the pump motor's efficiency in decimal form (0 = 0%, 1 = 100%).",""]},{"Name":"Field: Fraction of Motor Inefficiencies to Fluid Stream","Note":["This numeric field contains the pump motor's fraction of power loss to the fluid.",""]},{"Name":"Field: Pump Control Type","Note":["This is a choice field of Continuous or Intermittent. The operation of a constant speed pump bank is fairly straightforward. If the user designates a constant speed pump bank that is operating continuously, the pump bank will run regardless of whether or not there is a load. This may have the net effect of adding heat to the loop if no equipment is turned on. If the pump bank is constant speed and operates intermittently, the pump bank will run at its capacity if a load is sensed and will shut off if there is no load on the loop. Applicable availability managers (ref. AvailabilityManagerAssignmentList) may override this control by forcing the pump to be on or off.",""]},{"Name":"Field: Pump Flow Rate Schedule Name","Note":["The schedule values modify the value for Rated Flow Rate of the pump on a time basis. This essentially sets the maximum value available for the pump at a given time, {not the actual flow rate at that time}. The default is that the pump is ON and runs according to its other operational requirements specified above. This schedule is for special, not typical pump operations. For additional control over pump flow, EMS actuators can be employed.",""]},{"Name":"Field: Zone Name","Note":["This field is optional. It can be used to input the name of the Zone in which the pump is located in the model. If the pump is outdoors, or skin losses are not to be modeled, then leave this field blank. If a valid Zone name is entered, then the portion of electrical power consumed by the pump that is not added to the working fluid is added to the surrounding Zone.",""]},{"Name":"Field: Skin Loss Radiative Fraction","Note":["This field is optional. If a Zone is named in the previous field and pump losses are to be added to a surrounding thermal zone, then this input determines the split between thermal radiation and thermal convection for the heat losses from the pump. If it is left blank then all the losses will be convective.",""]},{"Name":"Field: Design Power Sizing Method","Note":["This field is optional. There are two choices PowerPerFlow and PowerPerFlowPerPressure. If PowerPerFlow is used the pump's Design Power Consumption will be calculated using the sizing factor from the input field Design Electric Power per Unit Flow Rate -- with Design Power Consumption = Design Maximum Flow Rate * scaling factor. If PowerPerFlowPerPressure is used the pump's Design Power Consumption will use the sizing factor from the input field Design Shaft Power per Unit Flow Rate Per Unit Head -- with Design Power Consumption = Design Maximum Flow Rate * Design Pump Head * scaling factor / Motor Efficiency. If omitted the default method of PowerPerFlowPerPressure will be used.",""]},{"Name":"Field: Design Electric Power per Unit Flow Rate","Note":["This field is optional. This input is used when the input field Design Power Consumption is set to autosize and the Design Power Sizing Method is set to PowerPerFlow. It allows setting the efficiency the pumping system's power consumption using only the design flow rate. If omitted the default value of 348701.1 W/(m^{3}/s) ( 22 W/gpm) will be used.",""]},{"Name":"Field: Design Shaft Power per Unit Flow Rate Per Unit Head","Note":["This field is optional. This input is used when the input field Design Power Consumption is set to autosize and the Design Power Sizing Method is set to PowerPerFlowPerPressure. It allows setting the efficiency of the impeller and drive assembly when calculating the pump power consumption for the design flow rate, motor efficiency, and pump head. If omitted the default value of 1.282051 W/((m^{3}/s)-Pa) will be used.",""]},{"Name":"Field: End-Use Subcategory","Note":["Allows you to specify a user-defined end-use subcategory, e.g., ``Main Pumps'', etc. A new meter for reporting is created for each unique subcategory (ref: Output:Meter objects). Subcategories are also reported in the ABUPS table. If this field is omitted or blank, the pump will be assigned to the ``General'' end-use subcategory.","","An example for constant speed pump bank follows.","","","","HeaderedPumps:ConstantSpeed,","  Chilled Water Headered Pumps,           !- Name","  CW Supply Inlet Node,                   !- Inlet Node Name","  CW Pumps Outlet Node,                   !- Outlet Node Name","  autosize,                               !- Total Design Flow Rate","  2,                                      !- Number of Pumps in Bank","  SEQUENTIAL,                             !- Flow Sequencing Control Scheme","  179352,                                 !- Design Pump Head","  autosize,                               !- Design Power Consumption","  0.9,                                    !- Motor Efficiency","  0.0,                                    !- Fraction of Motor Inefficiencies to Fluid Stream","  INTERMITTENT,                           !- Pump Control Type","  CoolingPumpAvailSched;                  !- Pump Flow Rate Schedule Name","",""]}]},{"Name":"Outputs","Paragraph":[{"Name":"Pump Electric Power [W]"},{"Name":"Pump Electric Energy [J]","Note":["These outputs are the electric power input to the pump motor. Consumption is metered on Pumps:Electricity, Electricity:Plant, and Electricity:Facility.",""]},{"Name":"Pump Shaft Power [W]","Note":["This is the shaft power delivered from the motor to the pump.",""]},{"Name":"Pump Fluid Heat Gain Rate [W]"},{"Name":"Pump Fluid Heat Gain Energy [J]","Note":["These outputs are the energy added to the fluid as heat. For the current algorithm, this is equal to Pump Shaft Power, because the loops are closed and all energy added to the fluid will ultimately become heat due to friction.",""]},{"Name":"Pump Outlet Temperature [C]"},{"Name":"Pump Mass Flow Rate [kg/s]","Note":["These outputs are the water outlet temperature and mass flow rate.",""]},{"Name":"Pump Operating Pumps Count ","Note":["This output tells the number of pumps in the pump bank operating at any reporting frequency.",""]},{"Name":"Pump Zone Total Heating Rate [W]"},{"Name":"Pump Zone Total Heating Energy [J]","Note":["These outputs are the thermal losses from the pump to the surrounding Zone. They are only available if a Zone was named in the pump s input. These indicate the amount of heat added to the zone from the pump s inefficiencies. They are the total heat loss including both convection and radiation.",""]},{"Name":"Pump Zone Convective Heating Rate [W]","Note":["This output is the thermal loss from the pump to the surrounding Zone in the form of convective gains directly to the zone air. It is only available if a Zone was named in the pump input.",""]},{"Name":"Pump Zone Radiative Heating Rate [W]","Note":["This output is the thermal loss from the pump to the surrounding Zone in the form of thermal radiation gains directly to the inside face of the zone s surfaces. It is only available if a Zone was named in the pump input.",""]}],"Note":["  HVAC,Average,Pump Electric Power [W]","","  HVAC,Sum, Pump Electric Energy [J]","","  HVAC,Average,Pump Shaft Power [W]","","  HVAC,Average, Pump Fluid Heat Gain Rate [W]","","  HVAC,Sum, Pump Fluid Heat Gain Energy [J]","","  HVAC,Average, Pump Outlet Temperature [C]","","  HVAC,Average,Pump Mass Flow Rate [kg/s]","","  HVAC,Average,Number of Pumps Operating ","","  HVAC, Average, Pump Zone Total Heating Rate [W]","","  HVAC, Sum, Pump Zone Total Heating Energy [J]","","  HVAC, Average, Pump Zone Convective Heating Rate [W]","","  HVAC, Average, Pump Zone Radiative Heating Rate [W]","",""]}],"Note":["Headered pumps are components with more than one identical pumps connected in parallel. The syntax for HeaderedPumps:ConstantSpeed is as follows.",""]},{"Name":"HeaderedPumps:VariableSpeed","Subsubsections":[{"Name":"Inputs","Paragraph":[{"Name":"Field: Name","Note":["This alpha field contains the identifying unique name for the pump bank.",""]},{"Name":"Field: Inlet Node Name","Note":["This alpha field contains the identifying name for the pump bank inlet node.",""]},{"Name":"Field: Outlet Node Name","Note":["This alpha field contains the identifying name for the pump bank outlet node.",""]},{"Name":"Field: Total Design Flow Rate","Note":["This numeric field contains the pump bank's rated volume flow rate in cubic meters per second. This is equal to the product of number of pumps and the flow rate of each individual pump. The field can be autosized.",""]},{"Name":"Field: Number of Pumps in Bank","Note":["The numeric field specifies the number of pumps present in the pump bank. All these pumps are connected in parallel internally.",""]},{"Name":"Field: Flow Sequencing Control Scheme","Note":["The alpha field specifies the scheme for sequencing flow. Currently the only choice is Sequential, where a pump in the pump bank will be turned ON only after fully loading the previous pump.",""]},{"Name":"Field: Design Pump Head","Note":["This numeric field contains the pump's design head in Pascals.",""]},{"Name":"Field: Design Power Consumption","Note":["This numeric field contains the pump bank's total power consumption in Watts. This field is equal to the product of number of pumps and the design power consumption of each individual pump. If the user is performing a pressure simulation on the loop in which this pump bank is found, this value would only be used to estimate pump efficiency. During reported calculations, the pump would use the loop pressure drop and current flow conditions along with efficiency to calculate pump power dynamically. This field can be autosized. When set to autosize the type of scaling factor is chosen in the input field Design Power Sizing Method.",""]},{"Name":"Field: Motor Efficiency","Note":["This numeric field contains the motor's efficiency of the individual pump (which will be equivalent to pump bank efficiency) in decimal form (0 = 0%, 1 = 100%).",""]},{"Name":"Field: Fraction of Motor Inefficiencies to Fluid Stream","Note":["This numeric field contains the individual pump s fraction of power loss to the fluid.",""]},{"Name":"Field: Coefficient 1 of the Part Load Performance Curve","Note":["This numeric field contains the first coefficient ({C_{1}}) in the part load ratio curve. The fraction of full load power is determined by the cubic equation:","","","FractionFullLoadPower = {C_1} + {C_2}PLR + {C_3}PL{R^2} + {C_4}PL{R^3}","","","where C_{1},C_{2},C_{3},and C_{4} are Coefficients 1 4 (below) and PLR is the Part Load Ratio.",""]},{"Name":"Field: Coefficient 2 of the Part Load Performance Curve","Note":["This numeric field contains the second coefficient ({C_{2}}) in the part load ratio curve.",""]},{"Name":"Field: Coefficient 3 of the Part Load Performance Curve","Note":["This numeric field contains the third coefficient ({C_{3}}) in the part load ratio curve.",""]},{"Name":"Field: Coefficient 4 of the Part Load Performance Curve","Note":["This numeric field contains the fourth coefficient ({C_{4}}) in the part load ratio curve.",""]},{"Name":"Field: Minimum Flow Rate Fraction","Note":["The numeric field specifies the minimum flow allowed for the pump bank as a fraction of the nominal flow. If the requested flow is less than minimum flow pump bank runs at minimum flow.",""]},{"Name":"Field: Pump Control Type","Note":["This is a choice field of Continuous or Intermittent. A variable speed pump bank is defined with maximum and minimum flow rates that are the physical limits of the device. If there is no load on the loop and the pump bank is operating intermittently, then the bank can shutdown. For any other condition such as the loop having a load and the pump bank is operating intermittently or the pump bank is continuously operating (regardless of the loading condition), the bank will operate and select a flow somewhere between the minimum and maximum limits. In these cases where the pump bank is running, it will try to meet the flow request made by demand side components. Applicable availability managers (ref. AvailabilityManagerAssignmentList) may override this control by forcing the pump to be on or off.",""]},{"Name":"Field: Pump Flow Rate Schedule Name","Note":["The schedule values modify the value for Rated Flow Rate of the pump on a time basis. This essentially sets the maximum value available for the pump at a given time, {not the actual flow rate at that time}. The default is that the pump is ON and runs according to its other operational requirements specified above. This schedule is for special, not typical pump operations. For additional control over pump flow, EMS actuators can be employed.",""]},{"Name":"Field: Zone Name","Note":["This field is optional. It can be used to input the name of the Zone in which the pump is located in the model. If the pump is outdoors, or skin losses are not to be modeled, then leave this field blank. If a valid Zone name is entered, then the portion of electrical power consumed by the pump that is not added to the working fluid is added to the surrounding Zone.",""]},{"Name":"Field: Skin Loss Radiative Fraction","Note":["This field is optional. If a Zone is named in the previous field and pump losses are to be added to a surrounding thermal zone, then this input determines the split between thermal radiation and thermal convection for the heat losses from the pump. If it is left blank then all the losses will be convective.",""]},{"Name":"Field: Design Power Sizing Method","Note":["This field is optional. There are two choices PowerPerFlow and PowerPerFlowPerPressure. If PowerPerFlow is used the pump's Design Power Consumption will be calculated using the sizing factor from the input field Design Electric Power per Unit Flow Rate -- with Design Power Consumption = Design Maximum Flow Rate * scaling factor. If PowerPerFlowPerPressure is used the pump's Design Power Consumption will use the sizing factor from the input field Design Shaft Power per Unit Flow Rate Per Unit Head -- with Design Power Consumption = Design Maximum Flow Rate * Design Pump Head * scaling factor / Motor Efficiency. If omitted the default method of PowerPerFlowPerPressure will be used.",""]},{"Name":"Field: Design Electric Power per Unit Flow Rate","Note":["This field is optional. This input is used when the input field Design Power Consumption is set to autosize and the Design Power Sizing Method is set to PowerPerFlow. It allows setting the efficiency the pumping system's power consumption using only the design flow rate. If omitted the default value of 348701.1 W/(m^{3}/s) ( 22 W/gpm) will be used.",""]},{"Name":"Field: Design Shaft Power per Unit Flow Rate Per Unit Head","Note":["This field is optional. This input is used when the input field Design Power Consumption is set to autosize and the Design Power Sizing Method is set to PowerPerFlowPerPressure. It allows setting the efficiency of the impeller and drive assembly when calculating the pump power consumption for the design flow rate, motor efficiency, and pump head. If omitted the default value of 1.282051 W/((m^{3}/s)-Pa) will be used.",""]},{"Name":"Field: End-Use Subcategory","Note":["Allows you to specify a user-defined end-use subcategory, e.g., ``Main Pumps'', etc. A new meter for reporting is created for each unique subcategory (ref: Output:Meter objects). Subcategories are also reported in the ABUPS table. If this field is omitted or blank, the pump will be assigned to the ``General'' end-use subcategory.","","An example of this object follows.","","","","HeaderedPumps:VariableSpeed,","  Chilled Water Headered Pumps, !- Name","  CW Supply Inlet Node,       !- Inlet Node Name","  CW Pumps Outlet Node,       !- Outlet Node Name","  autosize,                   !- Total Design Flow Rate {m3/s}","  2,                          !- Number of Pumps in Bank","  SEQUENTIAL,                 !- Flow Sequencing Control Scheme","  179352,                     !- Design Pump Head {Pa}","  autosize,                   !- Design Power Consumption {W}","  0.9,                        !- Motor Efficiency","  0.0,                        !- Fraction of Motor Inefficiencies to Fluid Stream","  0,                          !- Coefficient 1 of the Part Load Performance Curve","  1,                          !- Coefficient 2 of the Part Load Performance Curve","  0,                          !- Coefficient 3 of the Part Load Performance Curve","  0,                          !- Coefficient 4 of the Part Load Performance Curve","  0.1,                        !- Minimum Flow Rate {m3/s}","  INTERMITTENT,               !- Pump Control Type","  CoolingPumpAvailSched;      !- Pump Flow Rate Schedule Name","",""]}]},{"Name":"Outputs","Paragraph":[{"Name":"Pump Electric Power [W]"},{"Name":"Pump Electric Energy [J]","Note":["These outputs are the electric power input to the pump motor. Consumption is metered on Pumps:Electricity, Electricity:Plant, and Electricity:Facility.",""]},{"Name":"Pump Shaft Power [W]","Note":["This is the shaft power delivered from the motor to the pump.",""]},{"Name":"Pump Fluid Heat Gain Rate [W]"},{"Name":"Pump Fluid Heat Gain Energy [J]","Note":["These outputs are the energy added to the fluid as heat. For the current algorithm, this is equal to Pump Shaft Power, because the loops are closed and all energy added to the fluid will ultimately become heat due to friction.",""]},{"Name":"Pump Outlet Temperature [C]"},{"Name":"Pump Mass Flow Rate [kg/s]","Note":["These outputs are the water outlet temperature and mass flow rate.",""]},{"Name":"Pump Operating Pumps Count ","Note":["This output tells the number of pumps in the pump bank operating at any reporting frequency.",""]},{"Name":"Pump Zone Total Heating Rate [W]"},{"Name":"Pump Zone Total Heating Energy [J]","Note":["These outputs are the thermal losses from the pump to the surrounding Zone. They are only available if a Zone was named in the pump s input. These indicate the amount of heat added to the zone from the pump s inefficiencies. They are the total heat loss including both convection and radiation.",""]},{"Name":"Pump Zone Convective Heating Rate [W]","Note":["This output is the thermal loss from the pump to the surrounding Zone in the form of convective gains directly to the zone air. It is only available if a Zone was named in the pump input.",""]},{"Name":"Pump Zone Radiative Heating Rate [W]","Note":["This output is the thermal loss from the pump to the surrounding Zone in the form of thermal radiation gains directly to the inside face of the zone s surfaces. It is only available if a Zone was named in the pump input."]}],"Note":["  HVAC,Average,Pump Electric Power [W]","","  HVAC,Sum, Pump Electric Energy [J]","","  HVAC,Average,Pump Shaft Power [W]","","  HVAC,Average, Pump Fluid Heat Gain Rate [W]","","  HVAC,Sum, Pump Fluid Heat Gain Energy [J]","","  HVAC,Average, Pump Outlet Temperature [C]","","  HVAC,Average,Pump Mass Flow Rate [kg/s]","","  HVAC,Average,Number of pumps operating ","","  HVAC, Average, Pump Zone Total Heating Rate [W]","","  HVAC, Sum, Pump Zone Total Heating Energy [J]","","  HVAC, Average, Pump Zone Convective Heating Rate [W]","","  HVAC, Average, Pump Zone Radiative Heating Rate [W]","",""]}],"Note":["Headered pumps are components with more than one identical pumps connected in parallel. Currently this object may be found only in plant loops. The syntax for a HeaderedPumps:VariableSpeed pump is given below.",""]}]}